In [1]:
import pandas as pd

In [2]:
cars=pd.read_csv("cars.csv",index_col=0)

In [3]:
print(cars)

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [7]:
sel=cars["drives_right"]

In [8]:
cars["drives_right"]

US      True
AUS    False
JAP    False
IN     False
RU      True
MOR     True
EG      True
Name: drives_right, dtype: bool

In [6]:
type(cars["drives_right"])

pandas.core.series.Series

In [9]:
cars[sel]

     cars_per_cap        country  drives_right
US            809  United States          True
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [10]:
cars[cars["drives_right"]]

     cars_per_cap        country  drives_right
US            809  United States          True
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [11]:
print(cars)

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [14]:
cpc=cars["cars_per_cap"]

In [16]:
cars["cars_per_cap"]

US     809
AUS    731
JAP    588
IN      18
RU     200
MOR     70
EG      45
Name: cars_per_cap, dtype: int64

In [13]:
type(cars["cars_per_cap"])

pandas.core.series.Series

In [17]:
type(cpc>500)

pandas.core.series.Series

In [18]:
many_cars=cpc>500

In [19]:
cars[many_cars]

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False

In [21]:
import numpy as np

In [22]:
between=np.logical_and(cpc>100,cpc<500)

In [23]:
np.logical_and(cpc>100,cpc<500)

US     False
AUS    False
JAP    False
IN     False
RU      True
MOR    False
EG     False
Name: cars_per_cap, dtype: bool

In [24]:
type(np.logical_and(cpc>100,cpc<500))

pandas.core.series.Series

In [25]:
cars[between]

    cars_per_cap country  drives_right
RU           200  Russia          True

In [41]:
dict={"name":["shubham"],"age":[20]}

In [42]:
dict["name"]

['shubham']

In [43]:
pd.DataFrame(dict)

      name  age
0  shubham   20

In [45]:
pd.read_csv("cars.csv",index_col=0)

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [46]:
pd.read_csv("sample.csv")

   name  age
0   jay   20
1  Teno   19